NextFOAM-2405/tutorials/lagrangian/reactingParcelFoam/splashPanelFilm/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    f0;
        type    faceSet;
        action  new;
        source  patchToFace;
        patches (filmWalls);
    }

    {
        name    f0;
        type    faceSet;
        action  subset;
        source  boxToFace;
        min     (0.05 -100 -100);
        max     (100 100 100);
    }
);


// ************************************************************************* //
